Ran Plan for project: `prd-sm` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_secretsmanager_secret_version.test_secret must be replaced
-/+ resource "aws_secretsmanager_secret_version" "test_secret" {
!       arn                  = "arn:aws:secretsmanager:ap-southeast-1:699561668660:secret:sme-demo-D11o9D" -> (known after apply)
+       has_secret_string_wo = (known after apply)
!       id                   = "arn:aws:secretsmanager:ap-southeast-1:699561668660:secret:sme-demo-D11o9D|terraform-20250927113440575100000002" -> (known after apply)
!       secret_string        = (sensitive value) # forces replacement
!       version_id           = "terraform-20250927113440575100000002" -> (known after apply)
!       version_stages       = [
-           "AWSCURRENT",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # random_password.secret_password must be replaced
-/+ resource "random_password" "secret_password" {
!       bcrypt_hash = (sensitive value)
!       id          = "none" -> (known after apply)
!       length      = 25 -> 26 # forces replacement
!       result      = (sensitive value)
        # (9 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prd-sm
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://ex-github-complete.hqkhiem.online/lock?id=hqkhiem-org%252Fatlantis-testing%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prd-sm
  ```
Plan: 2 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```